Clean up formagtting
